Tekla Open API Reference for Tekla Structures 2025
Mesh Constructor
Overload List
Name | Description
Mesh()
 Creates a new empty mesh instance.
Mesh(ArrayList, ArrayList, ArrayList)
 Creates a new mesh instance with the given points, triangles and lines. Does not check the indices in the given triangles and lines array lists for correctness.
Top
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace